{"sections":{"smile-landing-page":{"type":"smile-landing-page","settings":{}},"1737407764b32bd375":{"type":"apps","settings":{"include_margins":true}},"image_with_text_E3NXrH":{"type":"image-with-text","disabled":true,"settings":{"image":"shopify:\/\/shop_images\/lindas_banners_mobile_14.png","image_position":"left","image_width":50,"title":"Corey's Cash","content":"<p>Welcome to Corey's Cash - Linda's Electric Quilters' Loyalty Rewards Program!<\/p><p>At Linda’s Electric Quilters, we believe that your dedication to your quilting projects deserves recognition. That's why we’re thrilled to introduce \"Corey's Cash,\" our exclusive loyalty program designed for quilting enthusiasts like you. With Corey's Cash, your purchases go beyond just transactions; they become opportunities to save on future buys and enjoy more of what you love.<\/p><p><strong>Earn While You Quilt:<\/strong> For every dollar you spend at Linda’s Electric Quilters, earn Corey's Cash that accumulate to unlock fantastic rewards. Our loyalty program is our way of saying thank you for choosing us for your quilting needs.<\/p><p><strong>Easy Redemption:<\/strong> Redeeming your Corey's Cash is simple and straightforward. Shop for your favorite quilting supplies, and at checkout, use your accumulated coins to receive discounts on quality products, from electric quilting machines to beautiful fabrics.<\/p><p><strong>More Than Just Savings:<\/strong> Corey's Cash is about more than just savings; it's about becoming part of a community. Receive exclusive access to members-only sales, special events, and first looks at new products. Plus, get quilting tips and tricks to help you create your next masterpiece.<\/p><p><strong>Join Today:<\/strong> Signing up for Corey's Cash is easy and free! Just visit Linda’s Electric Quilters, make your first purchase, and you're in. Start collecting your coins today and make the most out of your quilting journey with us.<\/p><p>Step into a world of rewards with Corey's Cash at Linda’s Electric Quilters - where every stitch counts!<\/p>","button_text":"Sign Up","button_link":"https:\/\/lindas.com\/account\/register"}},"faq_aTPt3L":{"type":"faq","blocks":{"separator_WjVPdk":{"type":"separator","settings":{"title":"Frequently Asked Questions"}},"question_T7gcPg":{"type":"question","settings":{"title":"How do I use Corey's Cash?","answer":"<p>Using Corey’s Cash rewards at checkout is easy! When shopping on our website, simply log into your account to access your available Corey’s Cash balance. Once you’ve added your items to the cart, proceed to checkout and look for the option to apply your rewards. Select the amount of points your would like to trade in for Corey’s Cash and it will automatically be deducted from your total. It’s our way of saying thank you for being a valued part of our Linda's community! <\/p>"}},"question_zcednN":{"type":"question","settings":{"title":"Do my points expire?","answer":"<p>Don’t let your Corey’s Cash go to waste! Points earned through our rewards program expire <strong>6 months<\/strong> from the date they’re earned. Be sure to use them to snag your favorite quilting supplies, tools, or kits before they vanish. Keep an eye on your balance and expiration dates by logging into your account—treat yourself to something special today!<\/p>"}},"question_LgacHr":{"type":"question","settings":{"title":"Can I use Corey's Cash with current sales?","answer":"<p>Great news! You can use your Corey’s Cash rewards alongside other active sales and promotions. Yes, you read that right—we love rewarding our amazing customers! Stack up your savings and enjoy the perks of being part of our quilting community. There’s no better time to use your Corey’s Cash to grab those must-have items. Happy shopping! <\/p>"}}},"block_order":["separator_WjVPdk","question_T7gcPg","question_zcednN","question_LgacHr"],"settings":{"show_contact_info":false,"contact_info_heading":"Any question?","contact_info_text":"<p>If we still haven't answered your question, you can contact us below and we will get back to you as soon as possible.<\/p>","contact_1_icon":"bi-phone","contact_1_heading":"Customer support","contact_1_text":"<p>Enter your text here<\/p>","contact_2_icon":"bi-email","contact_2_heading":"Send a message","contact_2_text":"<p>Enter your text here<\/p>"}}},"order":["smile-landing-page","1737407764b32bd375","image_with_text_E3NXrH","faq_aTPt3L"]}